{
    "games": [
        {
            "id": 0,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Freezeria",
            "url": "papas-freezeria",
            "description": "You've just started an easy job at an ice cream shop on a laidback tropical island, but things get hectic when all of Papa Louie's loyal customers arrive on the island for vacation! In this summertime installment in Papa Louie's restaurant series, you’ll need to add ingredients, blend syrups and ice cream, add toppings, and serve the unique Freezeria Sundaes to your waiting customers."
        },
        {
            "id": 1,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Burgeria",
            "url": "papas-burgeria",
            "description": "In this sequel to the award-winning hit game 'Papa's Pizzeria', you're headed back to the kitchen to run Papa Louie's new burger shop! You’ll have to take orders, grill burgers, add toppings, and serve the sandwiches to the waiting customers."
        },
        {
            "id": 2,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Pizzeria",
            "url": "papas-pizzeria",
            "description": "Help Roy run the pizzeria while Papa Louie is gone!  Top, bake, and serve pizzas to earn tips and unlock new customers."
        },
        {
            "id": 3,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Taco Mia!",
            "url": "papas-taco-mia",
            "description": "Papa Louie is branching out with a new taco restaurant, and he's putting you in charge! Help Mitch and Maggie take orders, cook meats, and build tacos in Papa's Taco Mia! Unlock over a dozen toppings and sauces as you work up the ranks, and craft the perfect taco for new customers and old favorites. Buy a variety of upgrades for your taco shop using your hard-earned tips and your weekly paycheck, and take on the extra challenge of serving the tough and picky 'Closer' customers at the end of each day. And if you can impress the new Food Critic, you'll earn a Blue Ribbon award that gives you higher tips! You can also earn up to 60 Badges while running Papa's Taco Mia, unlocked for a variety of achievements including using certain toppings, getting high scores in each Station, serving certain customers, and more!"
        },
        {
            "id": 4,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Cupcakeria",
            "url": "papas-cupcakeria",
            "description": "Bake the best cupcakes in town all year round in Papa's Cupcakeria! You'll need to choose baking cups, add batter, watch the oven, and decorate your cupcakes with a variety of frosting and toppings. As you level up and gain new customers, you'll notice the seasons changing in the town of Frostfield, along with new holiday celebrations! Help your customers get in the holiday spirit with seasonal clothing, furniture, and a new set of unlockable seasonal toppings for each holiday. Work your way through each holiday season to unlock over 100 ingredients, and become a cupcake-crafting master!"
        },
        {
            "id": 5,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Hot Doggeria",
            "url": "papas-hot-doggeria",
            "description": "Grill and serve hot dogs and other stadium snacks in Papa’s Hot Doggeria! You’ve got the best seat in the house at Griller Stadium, which happens to be behind the counter at the hot dog stand. You’ll need to grill dogs and sausages, add toppings and condiments, pour drinks, and pop popcorn for all of the fans at the game!"
        },
        {
            "id": 6,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Pancakeria",
            "url": "papas-pancakeria",
            "description": "Help Prudence and Cooper run Papa's Pancakeria! You'll need to cook and stack pancakes, french toast, and waffles in Papa's latest time-management game. The hands-on gameplay of the series returns, with new challenges related to stacking, arranging toppings and pouring syrup. In this latest installment, the great Foodini will arrive after each day with his traveling Mini Game Show! Foodini only accepts special tickets that are earned throughout the day, and has seven different games you can play. Each ticket gives you a chance to play his daily game to win many unique prizes. Also new to the series is an unlockable Drink Station that adds to the growing challenge of multitasking."
        },
        {
            "id": 7,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Wingeria",
            "url": "papas-wingeria",
            "description": "You're in charge of Papa's Wingeria, where you'll need to take orders, fry up wings and things in the fryers, toss your wings in Papa's award-winning sauces, and arrange them just right with garnishes and sides for your loyal customers. New to the series are Custom Workers, where you can create your own character in the game and customize their look with endless possibilities. Change the hair style, skin tone, facial features, posture, accessories, and more! You'll also get dozens of accessories and items of clothing for your custom worker, from the Shop and earned from Mini-Games."
        },
        {
            "id": 8,
            "data": {
                "width": 550,
                "height": 400
            },
            "name": "Shopping Cart Hero 3",
            "url": "shopping-cart-hero-3",
            "description": "The greatest launching game of all time is finally here! Shopping Cart Hero 3 is the newest game in everyone's favorite launch series! Your objective is simple; fling yourself as far as possible in a shopping cart! Run down the hill, jump in your cart then fly off the jump! Buy tons of upgrades along the way including dynamite and better wheels! How far can you get? Good luck!"
        },
        {
            "id": 9,
            "data": {
                "width": 800,
                "height": 540,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Sports Heads: Ice Hockey",
            "url": "sports-heads-ice-hockey",
            "description": "Sports Heads: Ice Hockey is a great sports game in which you have to defeat your opponent playing hockey with your mouth. The talented sports heads are back for a new tournament on the icy hockey field. Grab your stick, pick up the puck and go on to challenge your rival in this funny Sports Heads: Ice Hockey edition. Aim of the game is to score more goals than your opponent does."
        },
        {
            "id": 10,
            "data": {
                "width": 800,
                "height": 600,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Run 3",
            "url": "run-3",
            "description": "Run, skate, float, bounce, and/or jump your way through even more space tunnels! Don’t worry if they fall apart on you, repairing them is someone else’s job. Run 3 builds on the most fun parts of Run and Run 2, adding new mechanics, new characters, major improvements to Infinite mode, and even a storyline (finally!). Follow ten unique aliens as they try to crack the mysteries of the gravity-shifting Tunnels, search for a path to the distant Wormhole, or just ignore all that and go home. The story is ongoing, so stay tuned for updates!"
        },
        {
            "id": 11,
            "data": {
                "width": 800,
                "height": 540,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Sports Heads: Volleyball",
            "url": "sports-heads-volleyball",
            "description": ""
        },
        {
            "id": 12,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Pastaria",
            "url": "papas-pastaria",
            "description": "Head to Portallini and start your career as a pasta chef! You're in charge of Papa's Pastaria, where you'll take orders, cook noodles, add sauces and toppings, and toast breads to craft the perfect plate of pasta for your customers! New the series, you'll be opening the Dining Room in your restaurant, and you'll hire a server to help you get through the hectic workday! As you level up you'll earn new toppings, meet new customers, and work through the ever-changing seasons of the town."
        },
        {
            "id": 13,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Donuteria",
            "url": "papas-donuteria",
            "description": "Head to Papa's new restaurant in the Powder Point amusement park, where you'll serve stacks of delicious donuts!  Choose the correct dough and donut shape, fry the donuts, add icing and fillings, and finish them off with sprinkles and drizzles before boxing them up for your favorite customers.  Unlock new holiday shapes and ingredients as you play throughout the year, waiting for the Sky Ninja roller coaster to re-open in the summer!"
        },
        {
            "id": 14,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Cheeseria",
            "url": "papas-cheeseria",
            "description": "Build delicious grilled cheese sandwiches and pile on the fries at Papa's Cheeseria!  Customers can choose from a wide variety of breads, cheeses, toppings, and sauces for their sandwiches, and you'll unlock more as you play!  Create the gourmet grilled sandwiches, cook them on the grill, and serve them up with a heaping pile of fries.  Unlock 40 brand-new unique Special Recipes, and choose one to serve as the Daily Special each day in the restaurant, which also earns you special rewards!"
        },
        {
            "id": 15,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Bakeria",
            "url": "papas-bakeria",
            "description": "Build and bake mouth-watering pies in Papa's Bakeria!  You're in charge of the bakery in Whiskview Mall, where you'll be crafting new pies and cheesecakes for all of your wacky customers.  Complete a wide variety of tasks to earn dozens of new colorful Stickers, and use these Stickers to unlock a brand-new outfit for each of your customers!  Serve Daily Specials to your customers to earn bonuses and rare prizes, and unlock new ingredients and decorations for each of the 12 holiday seasons."
        },
        {
            "id": 16,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Sushiria",
            "url": "papas-sushiria",
            "description": "Slice and serve the most delicious sushi around in Papa's Sushiria!  You've started a job at Papa's new restaurant in Sakura Bay, where you'll create a variety of sushi rolls and bubble tea for all of your wacky customers.  Unlock and use over 140 ingredients for all sorts of delicious combinations across 12 different holiday seasons.  The all-new clothing system lets you get creative with your workers' holiday outfits, where you can mix and match colors and styles to boost your Holiday Spirit and earn more tips from your customers."
        },
        {
            "id": 17,
            "data": {
                "width": 640,
                "height": 480,
                "gameFile": "game.swf",
                "gameType": "flash"
            },
            "name": "Papa's Scooperia",
            "url": "papas-scooperia",
            "description": "Serve delicious sundaes of cookies and ice cream in Papa's Scooperia!  Your sightseeing trip to the big city is stopped short when you lose all of your money and belongings.  Stuck in Oniontown without the money to return home, Papa Louie has a unique solution to your problem:  Stay and run his brand-new ice cream shop!"
        },
        {
            "id": 18,
            "data": {
                "width": 700,
                "height": 400,
                "gameFile": "game",
                "gameType": "flash"
            },
            "name": "Super Smash Flash",
            "url": "super-smash-flash",
            "description": "Choose your characters and options and battle it out with 28 different characters in the original title that started it all – Super Smash Flash!This award-winning Super Smash Bros. fangame is complete with Classic Mode, Adventure Mode, and all of the things that make Smash Bros. feel like Smash Bros, with characters and content you’d never expect sprinkled about. Have fun!"
        },
        {
            "id": 19,
            "data": {
                "width": 640,
                "height": 800,
                "gameFile": "Fireboy & Watergirl - The Forest Temple.swf",
                "gameType": "flash"
            },
            "name": "Fireboy & Watergirl - The Forest Temple",
            "url": "fireboy-&-watergirl-the-forest-temple",
            "description": "Fireboy & Watergirl - The Forest Temple is the first cooperative platformer game in the Fireboy & Watergirl series. In this adventure, you explore 32 levels of the Forest Temple, controlling both the Fireboy and Watergirl characters through various puzzles."
        }
    ]
}